cylinder2DiceFoam/constant/parcelInjectionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      parcelInjectionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// (x y z) (u v w) d rho mDot T Cp (Y0..Y2) (Yg0..YgN) (Yl0..YlN) (Ys0..YsN)
(
    (-0.76 -0.0076 -0.05) (94 0 0) 30e-6 1000 0.002 247 4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.049) (94 0 0) 30e-6 1000 0.002 247 4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.048) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.047) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.046) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.045) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.044) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.043) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.042) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.041) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.040) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.039) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.038) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.037) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.036) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.035) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.034) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.033) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.032) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.031) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.030) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.029) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.028) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.027) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.026) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.025) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.024) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.023) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.022) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.021) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.020) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.019) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.018) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.017) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.016) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.015) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.014) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.013) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.012) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.011) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.010) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.009) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.008) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.007) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.006) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.005) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.004) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.003) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.002) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.001) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076     0) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076  0.05) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.049) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.048) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.047) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.046) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.045) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.044) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.043) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.042) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.041) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.040) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.039) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.038) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.037) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.036) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.035) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.034) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.033) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.032) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.031) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.030) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.029) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.028) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.027) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.026) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.025) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.024) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.023) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.022) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.021) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.020) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.019) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.018) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.017) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.016) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.015) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.014) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.013) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.012) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.011) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.010) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.009) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.008) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.007) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.006) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.005) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.004) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.003) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.002) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.001) (94 0 0) 30e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
);


// ************************************************************************* //
