cylinder2DiceFoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    front
    {
        type            empty;
    }
    inlet
    {
        type            fixedFluxPressure;
    }
    back
    {
        type            empty;
    }
    top
    {
        type            fixedFluxPressure;
    }
    cylinderfront
    {
        type            fixedFluxPressure;
    }
    bottom
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            fixedFluxPressure;
    }
    cylinderback
    {
        type            fixedFluxPressure;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
